package by.htp.les03.logic;

import static java.lang.Math.pow;

public class Task34 {
	public static void task() {
		/* Дана величина A, выражающая объем информации в байтах. Перевести
		   A в более крупные единицы измерения информации. */
	// Дано 3 байта, перевести в Кб, Мб, Гб, Тб
		double  a, b, c, d, f;
		
		a = 3;
		
		b = a/pow(2, 10);
		c = a/pow(2, 20);
		d = a/pow(2, 30);
		f = a/pow(2, 40);
		
		System.out.println("3 байта в килобайтах 3 Кб= "+ b +" байта;"+"\n"+ 
		"3 байта в мегабайтах 3 Мб= "+ c +" байта;" +"\n"+ "3 байта в гигабайтах "
		+ "3 Гб= "+ d +" байта;" +"\n"+ "3 байта в теробайтах 3 Тб= "+ f +" байта." );
	}

}
