package by.htp.les03.logic;

public class Task15 {
	public static void task() {
		// написать программу, которая выводит на экран первые четыре степени числа π (На маке Option+p)
		
		double s;
		final double π = 3.1415926536;
		
		s = Math.pow(π, 4);
		
		System.out.println(s);
	}

}
